turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4B.atdf
    <module name="ADCIFE" id="I7569" version="1.0.0" caption="ADC controller interface">
      <register-group name="ADCIFE" caption="ADC controller interface">
        <register name="CR" offset="0x0" rw="W" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="SWRST" caption="Software reset" mask="0x1"/>
          <bitfield name="TSTOP" caption="Internal timer stop bit" mask="0x2"/>
          <bitfield name="TSTART" caption="Internal timer start bit" mask="0x4"/>
          <bitfield name="STRIG" caption="Sequencer trigger" mask="0x8"/>
          <bitfield name="REFBUFEN" caption="Reference buffer enable" mask="0x10"/>
          <bitfield name="REFBUFDIS" caption="Reference buffer disable" mask="0x20"/>
          <bitfield name="EN" caption="ADCIFD enable" mask="0x100"/>
          <bitfield name="DIS" caption="ADCIFD disable" mask="0x200"/>
          <bitfield name="BGREQEN" caption="Bandgap buffer request enable" mask="0x400"/>
          <bitfield name="BGREQDIS" caption="Bandgap buffer request disable" mask="0x800"/>
        </register>
        <register name="CFG" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Configuration Register">
          <bitfield name="REFSEL" caption="ADC Reference Selection" mask="0xE"/>
          <bitfield name="SPEED" caption="ADC current reduction" mask="0x30"/>
          <bitfield name="CLKSEL" caption="Clock Selection for sequencer/ADC cell" mask="0x40"/>
          <bitfield name="PRESCAL" caption="Prescaler Rate Selection" mask="0x700"/>
        </register>
        <register name="SR" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="SEOC" caption="Sequencer end of conversion" mask="0x1"/>
          <bitfield name="LOVR" caption="Sequencer last converted value overrun" mask="0x2"/>
          <bitfield name="WM" caption="Window monitor" mask="0x4"/>
          <bitfield name="SMTRG" caption="Sequencer missed trigger event" mask="0x8"/>
          <bitfield name="SUTD" caption="Start-up time done" mask="0x10"/>
          <bitfield name="TTO" caption="Timer time-out" mask="0x20"/>
          <bitfield name="EN" caption="Enable Status" mask="0x1000000"/>
          <bitfield name="TBUSY" caption="Timer busy" mask="0x2000000"/>
          <bitfield name="SBUSY" caption="Sequencer busy" mask="0x4000000"/>
          <bitfield name="CBUSY" caption="Conversion busy" mask="0x8000000"/>
          <bitfield name="REFBUF" caption="Reference buffer status" mask="0x10000000"/>
        </register>
        <register name="SCR" offset="0xC" rw="W" size="4" access-size="4" atomic-op="clear:SR" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="SEOC" caption="Sequencer end of conversion" mask="0x1"/>
          <bitfield name="LOVR" caption="Sequencer last converted value overrun" mask="0x2"/>
          <bitfield name="WM" caption="Window monitor" mask="0x4"/>
          <bitfield name="SMTRG" caption="Sequencer missed trigger event" mask="0x8"/>
          <bitfield name="SUTD" caption="Start-up time done" mask="0x10"/>
          <bitfield name="TTO" caption="Timer time-out" mask="0x20"/>
        </register>
        <register name="RTS" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Resistive Touch Screen Register">
        </register>
        <register name="SEQCFG" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Sequencer Configuration Register">
          <bitfield name="HWLA" caption="Half word left adjust" mask="0x1"/>
          <bitfield name="BIPOLAR" caption="Bipolar Mode" mask="0x4"/>
          <bitfield name="GAIN" caption="Gain factor" mask="0x70"/>
          <bitfield name="GCOMP" caption="Gain Compensation" mask="0x80"/>
          <bitfield name="TRGSEL" caption="Trigger selection" mask="0x700"/>
          <bitfield name="RES" caption="Resolution" mask="0x1000"/>
          <bitfield name="INTERNAL" caption="Internal Voltage Source Selection" mask="0xC000"/>
          <bitfield name="MUXPOS" caption="MUX selection on Positive ADC input channel" mask="0xF0000"/>
          <bitfield name="MUXNEG" caption="MUX selection on Negative ADC input channel" mask="0x700000"/>
          <bitfield name="ZOOMRANGE" caption="Zoom shift/unipolar reference source selection" mask="0x70000000"/>
        </register>
        <register name="CDMA" offset="0x18" rw="W" size="4" access-size="4" initval="0x00000000" caption="Configuration Direct Memory Access Register">
          <mode name="FIRST_DMA_WORD">
            <bitfield name="HWLA" caption="Half word left adjust" mask="0x1"/>
            <bitfield name="BIPOLAR" caption="Bipolar Mode" mask="0x4"/>
            <bitfield name="STRIG" caption="Sequencer Trigger Event" mask="0x8"/>
            <bitfield name="GAIN" caption="Gain factor" mask="0x70"/>
            <bitfield name="GCOMP" caption="Gain Compensation" mask="0x80"/>
            <bitfield name="ENSTUP" caption="Enable Start-Up Time" mask="0x100"/>
            <bitfield name="RES" caption="Resolution" mask="0x1000"/>
            <bitfield name="TSS" caption="Internal timer start or stop bit" mask="0x2000"/>
            <bitfield name="INTERNAL" caption="Internal Voltage Source Selection" mask="0xC000"/>
            <bitfield name="MUXPOS" caption="MUX selection on Positive ADC input channel" mask="0xF0000"/>
            <bitfield name="MUXNEG" caption="MUX selection on Negative ADC input channel" mask="0x700000"/>
            <bitfield name="ZOOMRANGE" caption="Zoom shift/unipolar reference source selection" mask="0x70000000"/>
            <bitfield name="DW" caption="Double Word transmitting" mask="0x80000000"/>
          </mode>
          <mode name="SECOND_DMA_WORD">
            <bitfield name="LT" caption="Low Threshold" mask="0xFFF"/>
            <bitfield name="WM" caption="Window Monitor Mode" mask="0x7000"/>
            <bitfield name="HT" caption="High Threshold" mask="0xFFF0000"/>
            <bitfield name="DW" caption="Double Word transmitting" mask="0x80000000"/>
          </mode>
        </register>
        <register name="TIM" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Timing Configuration Register">
          <bitfield name="STARTUP" caption="Startup time" mask="0x1F"/>
          <bitfield name="ENSTUP" caption="Enable Startup" mask="0x100"/>
        </register>
        <register name="ITIMER" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Internal Timer Register">
          <bitfield name="ITMC" caption="Internal timer max counter" mask="0xFFFF"/>
        </register>
        <register name="WCFG" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Window Monitor Configuration Register">
          <bitfield name="WM" caption="Window Monitor Mode" mask="0x7000"/>
        </register>
        <register name="WTH" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Window Monitor Threshold Configuration Register">
          <bitfield name="LT" caption="Low threshold" mask="0xFFF"/>
          <bitfield name="HT" caption="High Threshold" mask="0xFFF0000"/>
        </register>
