turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4B.atdf
        <register name="ICR" offset="0x10" rw="W" size="4" access-size="4" atomic-op="clear:ISR" initval="0x00000000" caption="Interrupt Clear Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2" values="EIC_ICR__INT1"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4" values="EIC_ICR__INT2"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8" values="EIC_ICR__INT3"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10" values="EIC_ICR__INT4"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="MODE" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Mode Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2" values="EIC_MODE__INT1"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4" values="EIC_MODE__INT2"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8" values="EIC_MODE__INT3"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10" values="EIC_MODE__INT4"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="EDGE" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Edge Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2" values="EIC_EDGE__INT1"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4" values="EIC_EDGE__INT2"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8" values="EIC_EDGE__INT3"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10" values="EIC_EDGE__INT4"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="LEVEL" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Level Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="FILTER" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Filter Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="ASYNC" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Asynchronous Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="EN" offset="0x30" rw="W" size="4" access-size="4" atomic-op="set:CTRL" initval="0x00000000" caption="Enable Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="DIS" offset="0x34" rw="W" size="4" access-size="4" atomic-op="clear:CTRL" initval="0x00000000" caption="Disable Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="CTRL" offset="0x38" rw="R" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="NMI" caption="External Non Maskable CPU interrupt" mask="0x1"/>
          <bitfield name="INT1" caption="External Interrupt 1" mask="0x2"/>
          <bitfield name="INT2" caption="External Interrupt 2" mask="0x4"/>
          <bitfield name="INT3" caption="External Interrupt 3" mask="0x8"/>
          <bitfield name="INT4" caption="External Interrupt 4" mask="0x10"/>
          <bitfield name="INT5" caption="External Interrupt 5" mask="0x20"/>
          <bitfield name="INT6" caption="External Interrupt 6" mask="0x40"/>
          <bitfield name="INT7" caption="External Interrupt 7" mask="0x80"/>
          <bitfield name="INT8" caption="External Interrupt 8" mask="0x100"/>
          <bitfield name="INT9" caption="External Interrupt 9" mask="0x200"/>
          <bitfield name="INT10" caption="External Interrupt 10" mask="0x400"/>
          <bitfield name="INT11" caption="External Interrupt 11" mask="0x800"/>
          <bitfield name="INT12" caption="External Interrupt 12" mask="0x1000"/>
          <bitfield name="INT13" caption="External Interrupt 13" mask="0x2000"/>
          <bitfield name="INT14" caption="External Interrupt 14" mask="0x4000"/>
          <bitfield name="INT15" caption="External Interrupt 15" mask="0x8000"/>
        </register>
        <register name="VERSION" offset="0x3FC" rw="R" size="4" access-size="4" initval="0x00000302" caption="Version Register">
          <bitfield name="VERSION" caption="Version bits" mask="0xFFF"/>
        </register>
      </register-group>
      <value-group name="EIC_IER__INT1">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enable Interrupt." value="1"/>
      </value-group>
      <value-group name="EIC_IER__INT2">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enable Interrupt." value="1"/>
      </value-group>
      <value-group name="EIC_IER__INT3">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enable Interrupt." value="1"/>
      </value-group>
