turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4B.atdf
      <value-group name="FLASHCALW_FCR__FWS">
        <value name="0" caption="The flash is read with 0 wait states" value="0"/>
        <value name="1" caption="The flash is read with 1 wait states" value="1"/>
      </value-group>
      <value-group name="FLASHCALW_FCR__LOCKE">
        <value name="0" caption="Lock Error does not generate an interrupt" value="0"/>
        <value name="1" caption="Lock Error generates an interrupt" value="1"/>
      </value-group>
      <value-group name="FLASHCALW_FCR__PROGE">
        <value name="0" caption="Programming Error does not generate an interrupt" value="0"/>
        <value name="1" caption="Programming Error generates an interrupt" value="1"/>
      </value-group>
      <value-group name="FLASHCALW_FCMD__CMD">
        <value name="NOP" caption="No Operation" value="0"/>
        <value name="WP" caption="Write Page" value="1"/>
        <value name="EP" caption="Erase Page" value="2"/>
        <value name="CPB" caption="Clear Page Buffer" value="3"/>
        <value name="LP" caption="Lock Region containing page" value="4"/>
        <value name="UP" caption="Unlock Region containing page" value="5"/>
        <value name="EA" caption="Erase All, including secuity and fuse bits" value="6"/>
        <value name="WGPB" caption="Write General-Purpose fuse Bit" value="7"/>
        <value name="EGPB" caption="Erase General-Purpose fuse Bit" value="8"/>
        <value name="SSB" caption="Set Security Bit" value="9"/>
        <value name="PGPFB" caption="Program GPFuse Byte" value="10"/>
        <value name="EAGPF" caption="Erase All GP Fuses" value="11"/>
        <value name="QPR" caption="Quick Page Read" value="12"/>
        <value name="WUP" caption="Write User Page" value="13"/>
        <value name="EUP" caption="Erase User Page" value="14"/>
        <value name="QPRUP" caption="Quick Page Read User Page" value="15"/>
        <value name="HSEN" caption="High Speed Mode Enable" value="16"/>
        <value name="HSDIS" caption="High Speed Mode Disable" value="17"/>
      </value-group>
      <value-group name="FLASHCALW_FCMD__KEY">
        <value name="KEY" value="0xA5"/>
      </value-group>
      <value-group name="FLASHCALW_FSR__ECCERR">
        <value name="NOERROR" caption="No error" value="0"/>
        <value name="ONEECCERR" caption="One ECC error detected" value="1"/>
        <value name="TWOECCERR" caption="Two ECC errors detected" value="2"/>
      </value-group>
    </module>
    <module name="FUSES" id="I8322" version="1.1.0" caption="Non-Volatile Fuses">
      <register-group name="USERPAGE_FUSES"><register offset="0x4" size="4" name="USERPAGE_WORD_0" rw="RW" initval="0xFFFFFFFF" caption="User Page Word 0"><bitfield mask="0x00000001" name="WDTAUTO" values="WDTAUTO" caption="Watch dog timer auto enable/disable at startup"/><bitfield mask="0x0000007E" name="BOD33LEVEL" values="BOD33LEVEL" caption="3v3 Brown Out Detector Level"/><bitfield mask="0x00000080" name="BOD33EN" values="BODEN" caption="3v3 Brown Out Detector Enable"/><bitfield mask="0x00000300" name="BOD33ACTION" values="BODACTION" caption="3v3 Brown Out Detector Action"/><bitfield mask="0x00000400" name="BOD33HYST" values="BODHYST" caption="3v3 Brown Out Detector Hysteresis"/><bitfield mask="0x0001F800" name="BOD18LV" values="BOD18LV" caption="1v8 Brown Out Detector Level"/><bitfield mask="0x00020000" name="BOD18EN" values="BODEN" caption="1v8 Brown Out Detector Enable"/><bitfield mask="0x000C0000" name="BOD18ACTION" values="BODACTION" caption="1v8 Brown Out Detector Action"/><bitfield mask="0x00100000" name="BOD18HYST" values="BODHYST" caption="1v8 Brown Out Detector Hysteresis"/></register><register offset="0x0" size="4" name="USERPAGE_WORD_1" rw="RW" initval="0xFFFFFFFF" caption="User Page Word 1"/></register-group>
      <register-group name="FLASH_FUSES"><register offset="0x18" size="4" name="FGPFRLO" rw="RW" initval="0xFFFFFFFF" caption="Flash Controller General Purpose Fuse Register Low"><bitfield mask="0x00000001" name="LOCK0"/><bitfield mask="0x00000002" name="LOCK1"/><bitfield mask="0x00000004" name="LOCK2"/><bitfield mask="0x00000008" name="LOCK3"/><bitfield mask="0x00000010" name="LOCK4"/><bitfield mask="0x00000020" name="LOCK5"/><bitfield mask="0x00000040" name="LOCK6"/><bitfield mask="0x00000080" name="LOCK7"/><bitfield mask="0x00000100" name="LOCK8"/><bitfield mask="0x00000200" name="LOCK9"/><bitfield mask="0x00000400" name="LOCK10"/><bitfield mask="0x00000800" name="LOCK11"/><bitfield mask="0x00001000" name="LOCK12"/><bitfield mask="0x00002000" name="LOCK13"/><bitfield mask="0x00004000" name="LOCK14"/><bitfield mask="0x00008000" name="LOCK15"/></register></register-group><value-group name="WDTAUTO"><value name="WDT_ENABLE" caption="WDT is automatically enabled at startup" value="0"/><value name="WDT_DISABLE" caption="WDT is not automatically enabled at startup" value="1"/></value-group><value-group name="BODACTION"><value name="BOD_ACTION_NOACTION" caption="BOD No Action" value="0"/><value name="BOD_ACTION_GENERATE_RESET" caption="The BOD generates a reset" value="1"/><value name="BOD_ACTION_GENERATE_INTERRUPT" caption="The BOD generates an interrupt" value="2"/><value name="BOD_ACTION_RESERVED" caption="Reserved" value="3"/></value-group><value-group name="BODEN"><value name="BOD_DISABLED" caption="BOD disabled" value="0"/><value name="BOD_ENABLED" caption="BOD enabled" value="1"/></value-group><value-group name="BODHYST"><value name="BOD_HYST_DISABLED" caption="Disabled" value="0"/><value name="BOD_HYST_ENABLED" caption="Enabled" value="1"/></value-group><value-group name="BOD18LV"><value name="BOD_LEVEL_OFF" caption="BOD Level OFF" value="0"/><value name="BOD_LEVEL_1V56" caption="BOD Level 1.56V" value="31"/><value name="BOD_LEVEL_1V65" caption="BOD Level 1.65V" value="39"/></value-group><value-group name="BOD33LEVEL"><value name="BOD_LEVEL_OFF" caption="BOD Level OFF" value="0"/><value name="BOD_LEVEL_1V56" caption="BOD Level 1.56V" value="31"/><value name="BOD_LEVEL_1V65" caption="BOD Level 1.65V" value="39"/></value-group>
    </module>
    <module name="FREQM" id="I7530" version="3.1.1" caption="Frequency Meter">
      <register-group name="FREQM" caption="Frequency Meter">
        <register name="CTRL" offset="0x0" rw="W" size="4" access-size="4" initval="0x00000000" caption="Control register">
          <bitfield name="START" caption="Start frequency measurement" mask="0x1"/>
        </register>
