turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4B.atdf
        <register name="ODERT" offset="0x4C" rw="W" size="4" access-size="4" atomic-op="toggle:ODER" caption="Output Driver Enable Register - Toggle">
          <bitfield name="P0" caption="Output Driver Enable" mask="0x1"/>
          <bitfield name="P1" caption="Output Driver Enable" mask="0x2"/>
          <bitfield name="P2" caption="Output Driver Enable" mask="0x4"/>
          <bitfield name="P3" caption="Output Driver Enable" mask="0x8"/>
          <bitfield name="P4" caption="Output Driver Enable" mask="0x10"/>
          <bitfield name="P5" caption="Output Driver Enable" mask="0x20"/>
          <bitfield name="P6" caption="Output Driver Enable" mask="0x40"/>
          <bitfield name="P7" caption="Output Driver Enable" mask="0x80"/>
          <bitfield name="P8" caption="Output Driver Enable" mask="0x100"/>
          <bitfield name="P9" caption="Output Driver Enable" mask="0x200"/>
          <bitfield name="P10" caption="Output Driver Enable" mask="0x400"/>
          <bitfield name="P11" caption="Output Driver Enable" mask="0x800"/>
          <bitfield name="P12" caption="Output Driver Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Output Driver Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Output Driver Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Output Driver Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Output Driver Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Output Driver Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Output Driver Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Output Driver Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Output Driver Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Output Driver Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Output Driver Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Output Driver Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Output Driver Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Driver Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Driver Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Driver Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Driver Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Driver Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Driver Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Driver Enable" mask="0x80000000"/>
        </register>
        <register name="OVR" offset="0x50" rw="RW" size="4" access-size="4" caption="Output Value Register">
          <bitfield name="P0" caption="Output Value" mask="0x1"/>
          <bitfield name="P1" caption="Output Value" mask="0x2"/>
          <bitfield name="P2" caption="Output Value" mask="0x4"/>
          <bitfield name="P3" caption="Output Value" mask="0x8"/>
          <bitfield name="P4" caption="Output Value" mask="0x10"/>
          <bitfield name="P5" caption="Output Value" mask="0x20"/>
          <bitfield name="P6" caption="Output Value" mask="0x40"/>
          <bitfield name="P7" caption="Output Value" mask="0x80"/>
          <bitfield name="P8" caption="Output Value" mask="0x100"/>
          <bitfield name="P9" caption="Output Value" mask="0x200"/>
          <bitfield name="P10" caption="Output Value" mask="0x400"/>
          <bitfield name="P11" caption="Output Value" mask="0x800"/>
          <bitfield name="P12" caption="Output Value" mask="0x1000"/>
          <bitfield name="P13" caption="Output Value" mask="0x2000"/>
          <bitfield name="P14" caption="Output Value" mask="0x4000"/>
          <bitfield name="P15" caption="Output Value" mask="0x8000"/>
          <bitfield name="P16" caption="Output Value" mask="0x10000"/>
          <bitfield name="P17" caption="Output Value" mask="0x20000"/>
          <bitfield name="P18" caption="Output Value" mask="0x40000"/>
          <bitfield name="P19" caption="Output Value" mask="0x80000"/>
          <bitfield name="P20" caption="Output Value" mask="0x100000"/>
          <bitfield name="P21" caption="Output Value" mask="0x200000"/>
          <bitfield name="P22" caption="Output Value" mask="0x400000"/>
          <bitfield name="P23" caption="Output Value" mask="0x800000"/>
          <bitfield name="P24" caption="Output Value" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Value" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Value" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Value" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Value" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Value" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Value" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Value" mask="0x80000000"/>
        </register>
        <register name="OVRS" offset="0x54" rw="W" size="4" access-size="4" atomic-op="set:OVR" caption="Output Value Register - Set">
          <bitfield name="P0" caption="Output Value" mask="0x1"/>
          <bitfield name="P1" caption="Output Value" mask="0x2"/>
          <bitfield name="P2" caption="Output Value" mask="0x4"/>
          <bitfield name="P3" caption="Output Value" mask="0x8"/>
          <bitfield name="P4" caption="Output Value" mask="0x10"/>
          <bitfield name="P5" caption="Output Value" mask="0x20"/>
          <bitfield name="P6" caption="Output Value" mask="0x40"/>
          <bitfield name="P7" caption="Output Value" mask="0x80"/>
          <bitfield name="P8" caption="Output Value" mask="0x100"/>
          <bitfield name="P9" caption="Output Value" mask="0x200"/>
          <bitfield name="P10" caption="Output Value" mask="0x400"/>
          <bitfield name="P11" caption="Output Value" mask="0x800"/>
          <bitfield name="P12" caption="Output Value" mask="0x1000"/>
          <bitfield name="P13" caption="Output Value" mask="0x2000"/>
          <bitfield name="P14" caption="Output Value" mask="0x4000"/>
          <bitfield name="P15" caption="Output Value" mask="0x8000"/>
          <bitfield name="P16" caption="Output Value" mask="0x10000"/>
          <bitfield name="P17" caption="Output Value" mask="0x20000"/>
          <bitfield name="P18" caption="Output Value" mask="0x40000"/>
          <bitfield name="P19" caption="Output Value" mask="0x80000"/>
          <bitfield name="P20" caption="Output Value" mask="0x100000"/>
          <bitfield name="P21" caption="Output Value" mask="0x200000"/>
          <bitfield name="P22" caption="Output Value" mask="0x400000"/>
          <bitfield name="P23" caption="Output Value" mask="0x800000"/>
          <bitfield name="P24" caption="Output Value" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Value" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Value" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Value" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Value" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Value" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Value" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Value" mask="0x80000000"/>
        </register>
        <register name="OVRC" offset="0x58" rw="W" size="4" access-size="4" atomic-op="clear:OVR" caption="Output Value Register - Clear">
          <bitfield name="P0" caption="Output Value" mask="0x1"/>
          <bitfield name="P1" caption="Output Value" mask="0x2"/>
          <bitfield name="P2" caption="Output Value" mask="0x4"/>
          <bitfield name="P3" caption="Output Value" mask="0x8"/>
          <bitfield name="P4" caption="Output Value" mask="0x10"/>
          <bitfield name="P5" caption="Output Value" mask="0x20"/>
          <bitfield name="P6" caption="Output Value" mask="0x40"/>
          <bitfield name="P7" caption="Output Value" mask="0x80"/>
          <bitfield name="P8" caption="Output Value" mask="0x100"/>
          <bitfield name="P9" caption="Output Value" mask="0x200"/>
          <bitfield name="P10" caption="Output Value" mask="0x400"/>
          <bitfield name="P11" caption="Output Value" mask="0x800"/>
          <bitfield name="P12" caption="Output Value" mask="0x1000"/>
          <bitfield name="P13" caption="Output Value" mask="0x2000"/>
          <bitfield name="P14" caption="Output Value" mask="0x4000"/>
          <bitfield name="P15" caption="Output Value" mask="0x8000"/>
          <bitfield name="P16" caption="Output Value" mask="0x10000"/>
          <bitfield name="P17" caption="Output Value" mask="0x20000"/>
          <bitfield name="P18" caption="Output Value" mask="0x40000"/>
          <bitfield name="P19" caption="Output Value" mask="0x80000"/>
          <bitfield name="P20" caption="Output Value" mask="0x100000"/>
          <bitfield name="P21" caption="Output Value" mask="0x200000"/>
          <bitfield name="P22" caption="Output Value" mask="0x400000"/>
          <bitfield name="P23" caption="Output Value" mask="0x800000"/>
          <bitfield name="P24" caption="Output Value" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Value" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Value" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Value" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Value" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Value" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Value" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Value" mask="0x80000000"/>
        </register>
        <register name="OVRT" offset="0x5C" rw="W" size="4" access-size="4" atomic-op="toggle:OVR" caption="Output Value Register - Toggle">
          <bitfield name="P0" caption="Output Value" mask="0x1"/>
          <bitfield name="P1" caption="Output Value" mask="0x2"/>
          <bitfield name="P2" caption="Output Value" mask="0x4"/>
          <bitfield name="P3" caption="Output Value" mask="0x8"/>
          <bitfield name="P4" caption="Output Value" mask="0x10"/>
          <bitfield name="P5" caption="Output Value" mask="0x20"/>
          <bitfield name="P6" caption="Output Value" mask="0x40"/>
          <bitfield name="P7" caption="Output Value" mask="0x80"/>
          <bitfield name="P8" caption="Output Value" mask="0x100"/>
          <bitfield name="P9" caption="Output Value" mask="0x200"/>
          <bitfield name="P10" caption="Output Value" mask="0x400"/>
          <bitfield name="P11" caption="Output Value" mask="0x800"/>
          <bitfield name="P12" caption="Output Value" mask="0x1000"/>
          <bitfield name="P13" caption="Output Value" mask="0x2000"/>
          <bitfield name="P14" caption="Output Value" mask="0x4000"/>
          <bitfield name="P15" caption="Output Value" mask="0x8000"/>
          <bitfield name="P16" caption="Output Value" mask="0x10000"/>
          <bitfield name="P17" caption="Output Value" mask="0x20000"/>
          <bitfield name="P18" caption="Output Value" mask="0x40000"/>
          <bitfield name="P19" caption="Output Value" mask="0x80000"/>
          <bitfield name="P20" caption="Output Value" mask="0x100000"/>
          <bitfield name="P21" caption="Output Value" mask="0x200000"/>
          <bitfield name="P22" caption="Output Value" mask="0x400000"/>
          <bitfield name="P23" caption="Output Value" mask="0x800000"/>
          <bitfield name="P24" caption="Output Value" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Value" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Value" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Value" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Value" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Value" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Value" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Value" mask="0x80000000"/>
        </register>
