turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4B.atdf
      <value-group name="SPI_IMR__TDRE">
        <value name="0" caption="The corresponding interrupt is not enabled." value="0"/>
        <value name="1" caption="The corresponding interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="SPI_IMR__TXBUFE">
        <value name="0" caption="The corresponding interrupt is not enabled." value="0"/>
        <value name="1" caption="The corresponding interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="SPI_IMR__TXEMPTY">
        <value name="0" caption="The corresponding interrupt is not enabled." value="0"/>
        <value name="1" caption="The corresponding interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="SPI_CSR__BITS">
        <value name="8_BPT" caption="8 bits per transfer" value="0"/>
        <value name="9_BPT" caption="9 bits per transfer" value="1"/>
        <value name="10_BPT" caption="10 bits per transfer" value="2"/>
        <value name="11_BPT" caption="11 bits per transfer" value="3"/>
        <value name="12_BPT" caption="12 bits per transfer" value="4"/>
        <value name="13_BPT" caption="13 bits per transfer" value="5"/>
        <value name="14_BPT" caption="14 bits per transfer" value="6"/>
        <value name="15_BPT" caption="15 bits per transfer" value="7"/>
        <value name="16_BPT" caption="16 bits per transfer" value="8"/>
      </value-group>
      <value-group name="SPI_CSR__CPOL">
        <value name="0" caption="The inactive state value of SPCK is logic level zero." value="0"/>
        <value name="1" caption="The inactive state value of SPCK is logic level one.CPOL is used to determine the inactive state value of the serial clock (SPCK). It is used with NCPHA to produce therequired clock/data relationship between master and slave devices." value="1"/>
      </value-group>
      <value-group name="SPI_CSR__CSAAT">
        <value name="0" caption="The Peripheral Chip Select Line rises as soon as the last transfer is achieved." value="0"/>
        <value name="1" caption="The Peripheral Chip Select does not rise after the last transfer is achieved. It remains active until a new transfer isrequested on a different chip select." value="1"/>
      </value-group>
      <value-group name="SPI_CSR__NCPHA">
        <value name="0" caption="Data is changed on the leading edge of SPCK and captured on the following edge of SPCK." value="0"/>
        <value name="1" caption="Data is captured on the leading edge of SPCK and changed on the following edge of SPCK.NCPHA determines which edge of SPCK causes data to change and which edge causes data to be captured. NCPHA isused with CPOL to produce the required clock/data relationship between master and slave devices." value="1"/>
      </value-group>
      <value-group name="SPI_WPCR__WPKEY">
        <value name="VALUE" caption="SPI Write Protection Key Password" value="0x00535049"/>
      </value-group>
      <value-group name="SPI_WPSR__WPVS">
        <value name="WRITE_WITH_WP" caption="The Write Protection has blocked a Write access to a protected register (since the last read)." value="1"/>
        <value name="SWRST_WITH_WP" caption="Software Reset has been performed while Write Protection was enabled (since the last read or since the last write access on MR, IER, IDR or CSRx)." value="2"/>
        <value name="UNEXPECTED_WRITE" caption="Write accesses have been detected on MR (while a chip select was active) or on CSRi (while the Chip Select 'i' was active) since the last read." value="4"/>
      </value-group>
    </module>
    <module name="TC" id="I7604" version="4.0.2" caption="Timer/Counter">
      <register-group name="channel" size="0x40">
        <register name="CCR" offset="0x0" rw="W" size="4" access-size="4" initval="0x00000000" caption="Channel Control Register Channel">
          <bitfield name="CLKEN" caption="Counter Clock Enable Command" mask="0x1" values="TC_CCR__CLKEN"/>
          <bitfield name="CLKDIS" caption="Counter Clock Disable Command" mask="0x2" values="TC_CCR__CLKDIS"/>
          <bitfield name="SWTRG" caption="Software Trigger Command" mask="0x4" values="TC_CCR__SWTRG"/>
        </register>
        <register name="CMR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Channel Mode Register Channel">
          <mode name="CAPTURE">
            <bitfield name="TCCLKS" caption="Clock Selection" mask="0x7" values="TC_CMR__TCCLKS"/>
            <bitfield name="CLKI" caption="Clock Invert" mask="0x8" values="TC_CMR__CLKI"/>
            <bitfield name="BURST" caption="Burst Signal Selection" mask="0x30" values="TC_CMR__BURST"/>
            <bitfield name="LDBSTOP" caption="Counter Clock Stopped with RB Loading" mask="0x40" values="TC_CMR__LDBSTOP"/>
            <bitfield name="LDBDIS" caption="Counter Clock Disable with RB Loading" mask="0x80" values="TC_CMR__LDBDIS"/>
            <bitfield name="ETRGEDG" caption="External Trigger Edge Selection" mask="0x300" values="TC_CMR__ETRGEDG"/>
            <bitfield name="ABETRG" caption="TIOA or TIOB External Trigger Selection" mask="0x400" values="TC_CMR__ABETRG"/>
            <bitfield name="CPCTRG" caption="RC Compare Trigger Enable" mask="0x4000" values="TC_CMR__CPCTRG"/>
            <bitfield name="WAVE" caption="Wave" mask="0x8000" values="TC_CMR__WAVE"/>
            <bitfield name="LDRA" caption="RA Loading Selection" mask="0x30000" values="TC_CMR__LDRA"/>
            <bitfield name="LDRB" caption="RB Loading Selection" mask="0xC0000" values="TC_CMR__LDRB"/>
          </mode>
          <mode name="WAVEFORM">
            <bitfield name="TCCLKS" caption="Clock Selection" mask="0x7" values="TC_CMR__TCCLKS"/>
            <bitfield name="CLKI" caption="Clock Invert" mask="0x8" values="TC_CMR__CLKI"/>
            <bitfield name="BURST" caption="Burst Signal Selection" mask="0x30" values="TC_CMR__BURST"/>
            <bitfield name="CPCSTOP" caption="Counter Clock Stopped with RC Compare" mask="0x40" values="TC_CMR__CPCSTOP"/>
            <bitfield name="CPCDIS" caption="Counter Clock Disable with RC Compare" mask="0x80" values="TC_CMR__CPCDIS"/>
            <bitfield name="EEVTEDG" caption="External Event Edge Selection" mask="0x300" values="TC_CMR__EEVTEDG"/>
            <bitfield name="EEVT" caption="External Event Selection" mask="0xC00" values="TC_CMR__EEVT"/>
            <bitfield name="ENETRG" caption="External Event Trigger Enable" mask="0x1000" values="TC_CMR__ENETRG"/>
            <bitfield name="WAVSEL" caption="Waveform Selection" mask="0x6000" values="TC_CMR__WAVSEL"/>
            <bitfield name="WAVE" caption="WAVE" mask="0x8000" values="TC_CMR__WAVE"/>
            <bitfield name="ACPA" caption="RA Compare Effect on TIOA" mask="0x30000" values="TC_CMR__ACPA"/>
            <bitfield name="ACPC" caption="RC Compare Effect on TIOA" mask="0xC0000" values="TC_CMR__ACPC"/>
            <bitfield name="AEEVT" caption="External Event Effect on TIOA" mask="0x300000" values="TC_CMR__AEEVT"/>
            <bitfield name="ASWTRG" caption="Software Trigger Effect on TIOA" mask="0xC00000" values="TC_CMR__ASWTRG"/>
            <bitfield name="BCPB" caption="RB Compare Effect on TIOB" mask="0x3000000" values="TC_CMR__BCPB"/>
            <bitfield name="BCPC" caption="RC Compare Effect on TIOB" mask="0xC000000" values="TC_CMR__BCPC"/>
            <bitfield name="BEEVT" caption="External Event Effect on TIOB" mask="0x30000000" values="TC_CMR__BEEVT"/>
            <bitfield name="BSWTRG" caption="Software Trigger Effect on TIOB" mask="0xC0000000" values="TC_CMR__BSWTRG"/>
          </mode>
        </register>
        <register name="SMMR" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Stepper Motor Mode Register">
          <bitfield name="GCEN" caption="Gray Count Enable" mask="0x1"/>
          <bitfield name="DOWN" caption="Down Count" mask="0x2"/>
        </register>
        <register name="CV" offset="0x10" rw="R" size="4" access-size="4" initval="0x00000000" caption="Counter Value Channel">
          <bitfield name="CV" caption="Counter Value" mask="0xFFFF" values="TC_CV__CV"/>
        </register>
        <register name="RA" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Register A Channel">
          <bitfield name="RA" caption="Register A" mask="0xFFFF" values="TC_RA__RA"/>
        </register>
        <register name="RB" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Register B Channel">
          <bitfield name="RB" caption="Register B" mask="0xFFFF" values="TC_RB__RB"/>
        </register>
        <register name="RC" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Register C Channel">
          <bitfield name="RC" caption="Register C" mask="0xFFFF" values="TC_RC__RC"/>
        </register>
