turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4B.atdf
      <value-group name="USART_IDR__LINHTE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__LINSTE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__NACK">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__OVRE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__PARE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__RIIC">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__RXBRK">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__RXBUFF">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__RXRDY">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__TIMEOUT">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__TXBUFE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__TXEMPTY">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__TXRDY">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__UNRE">
        <value name="0" caption="No Effect" value="0"/>
        <value name="1" caption="Disables the interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IDR__MANEA">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="USART_IMR__CTSIC">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__DCDIC">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__DSRIC">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__FRAME">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__ITER">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__LINHTE">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__LINSTE">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__NACK">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__OVRE">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__PARE">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__RIIC">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__RXBRK">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__RXBUFF">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__RXRDY">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__TIMEOUT">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__TXBUFE">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__TXEMPTY">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__TXRDY">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__UNRE">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_IMR__MANEA">
        <value name="0" caption="The interrupt is disabled" value="0"/>
        <value name="1" caption="The interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="USART_CSR__CTSIC">
        <value name="0" caption="No input change has been detected on the CTS pin since the last read of CSR" value="0"/>
        <value name="1" caption="At least one input change has been detected on the CTS pin since the last read of CSR" value="1"/>
      </value-group>
