turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4B.atdf
        <register name="UDFNUM" offset="0x20" rw="R" size="4" access-size="4" initval="0x00000000" caption="Device Frame Number Register">
          <bitfield name="MFNUM" caption="Micro Frame Number" mask="0x7"/>
          <bitfield name="FNUM" caption="Frame Number" mask="0x3FF8"/>
          <bitfield name="FNCERR" caption="Frame Number CRC Error" mask="0x8000"/>
        </register>
        <register name="UECFG0" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Endpoint Configuration Register">
          <bitfield name="EPBK" caption="Endpoint Bank" mask="0x4" values="USBC_UECFG0__EPBK"/>
          <bitfield name="EPSIZE" caption="Endpoint Size" mask="0x70" values="USBC_UECFG0__EPSIZE"/>
          <bitfield name="EPDIR" caption="Endpoint Direction" mask="0x100" values="USBC_UECFG0__EPDIR"/>
          <bitfield name="EPTYPE" caption="Endpoint Type" mask="0x1800" values="USBC_UECFG0__EPTYPE"/>
          <bitfield name="REPNB" caption="Redirected Endpoint Number" mask="0xF0000"/>
        </register>
        <register name="UECFG1" offset="0x104" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Endpoint Configuration Register">
          <bitfield name="EPBK" caption="Endpoint Bank" mask="0x4" values="USBC_UECFG1__EPBK"/>
          <bitfield name="EPSIZE" caption="Endpoint Size" mask="0x70" values="USBC_UECFG1__EPSIZE"/>
          <bitfield name="EPDIR" caption="Endpoint Direction" mask="0x100" values="USBC_UECFG1__EPDIR"/>
          <bitfield name="EPTYPE" caption="Endpoint Type" mask="0x1800" values="USBC_UECFG1__EPTYPE"/>
          <bitfield name="REPNB" caption="Redirected Endpoint Number" mask="0xF0000"/>
        </register>
        <register name="UECFG2" offset="0x108" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Endpoint Configuration Register">
          <bitfield name="EPBK" caption="Endpoint Bank" mask="0x4" values="USBC_UECFG2__EPBK"/>
          <bitfield name="EPSIZE" caption="Endpoint Size" mask="0x70" values="USBC_UECFG2__EPSIZE"/>
          <bitfield name="EPDIR" caption="Endpoint Direction" mask="0x100" values="USBC_UECFG2__EPDIR"/>
          <bitfield name="EPTYPE" caption="Endpoint Type" mask="0x1800" values="USBC_UECFG2__EPTYPE"/>
          <bitfield name="REPNB" caption="Redirected Endpoint Number" mask="0xF0000"/>
        </register>
        <register name="UECFG3" offset="0x10C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Endpoint Configuration Register">
          <bitfield name="EPBK" caption="Endpoint Bank" mask="0x4" values="USBC_UECFG3__EPBK"/>
          <bitfield name="EPSIZE" caption="Endpoint Size" mask="0x70" values="USBC_UECFG3__EPSIZE"/>
          <bitfield name="EPDIR" caption="Endpoint Direction" mask="0x100" values="USBC_UECFG3__EPDIR"/>
          <bitfield name="EPTYPE" caption="Endpoint Type" mask="0x1800" values="USBC_UECFG3__EPTYPE"/>
          <bitfield name="REPNB" caption="Redirected Endpoint Number" mask="0xF0000"/>
        </register>
        <register name="UECFG4" offset="0x110" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Endpoint Configuration Register">
          <bitfield name="EPBK" caption="Endpoint Bank" mask="0x4" values="USBC_UECFG4__EPBK"/>
          <bitfield name="EPSIZE" caption="Endpoint Size" mask="0x70" values="USBC_UECFG4__EPSIZE"/>
          <bitfield name="EPDIR" caption="Endpoint Direction" mask="0x100" values="USBC_UECFG4__EPDIR"/>
          <bitfield name="EPTYPE" caption="Endpoint Type" mask="0x1800" values="USBC_UECFG4__EPTYPE"/>
          <bitfield name="REPNB" caption="Redirected Endpoint Number" mask="0xF0000"/>
        </register>
        <register name="UECFG5" offset="0x114" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Endpoint Configuration Register">
          <bitfield name="EPBK" caption="Endpoint Bank" mask="0x4" values="USBC_UECFG5__EPBK"/>
          <bitfield name="EPSIZE" caption="Endpoint Size" mask="0x70" values="USBC_UECFG5__EPSIZE"/>
          <bitfield name="EPDIR" caption="Endpoint Direction" mask="0x100" values="USBC_UECFG5__EPDIR"/>
          <bitfield name="EPTYPE" caption="Endpoint Type" mask="0x1800" values="USBC_UECFG5__EPTYPE"/>
          <bitfield name="REPNB" caption="Redirected Endpoint Number" mask="0xF0000"/>
        </register>
        <register name="UECFG6" offset="0x118" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Endpoint Configuration Register">
          <bitfield name="EPBK" caption="Endpoint Bank" mask="0x4" values="USBC_UECFG6__EPBK"/>
          <bitfield name="EPSIZE" caption="Endpoint Size" mask="0x70" values="USBC_UECFG6__EPSIZE"/>
          <bitfield name="EPDIR" caption="Endpoint Direction" mask="0x100" values="USBC_UECFG6__EPDIR"/>
          <bitfield name="EPTYPE" caption="Endpoint Type" mask="0x1800" values="USBC_UECFG6__EPTYPE"/>
          <bitfield name="REPNB" caption="Redirected Endpoint Number" mask="0xF0000"/>
        </register>
        <register name="UECFG7" offset="0x11C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Endpoint Configuration Register">
          <bitfield name="EPBK" caption="Endpoint Bank" mask="0x4" values="USBC_UECFG7__EPBK"/>
          <bitfield name="EPSIZE" caption="Endpoint Size" mask="0x70" values="USBC_UECFG7__EPSIZE"/>
          <bitfield name="EPDIR" caption="Endpoint Direction" mask="0x100" values="USBC_UECFG7__EPDIR"/>
          <bitfield name="EPTYPE" caption="Endpoint Type" mask="0x1800" values="USBC_UECFG7__EPTYPE"/>
          <bitfield name="REPNB" caption="Redirected Endpoint Number" mask="0xF0000"/>
        </register>
        <register name="UESTA0" offset="0x130" rw="R" size="4" access-size="4" initval="0x00000100" caption="Endpoint Status Register">
          <bitfield name="TXINI" caption="Transmitted IN Data Interrupt" mask="0x1"/>
          <bitfield name="RXOUTI" caption="Received OUT Data Interrupt" mask="0x2"/>
          <bitfield name="RXSTPI" caption="Received SETUP Interrupt" mask="0x4"/>
          <bitfield name="NAKOUTI" caption="NAKed OUT Interrupt" mask="0x8"/>
          <bitfield name="NAKINI" caption="NAKed IN Interrupt" mask="0x10"/>
          <bitfield name="STALLEDI" caption="STALLed Interrupt" mask="0x40"/>
          <bitfield name="DTSEQ" caption="Data Toggle Sequence" mask="0x300"/>
          <bitfield name="RAMACERI" caption="Ram Access Error Interrupt" mask="0x800"/>
          <bitfield name="NBUSYBK" caption="Number Of Busy Banks" mask="0x3000"/>
          <bitfield name="CURRBK" caption="Current Bank" mask="0xC000"/>
          <bitfield name="CTRLDIR" caption="Control Direction" mask="0x20000" values="USBC_UESTA0__CTRLDIR"/>
        </register>
